;--------------------------------
;ADVENT Dark Events and Abilities
;--------------------------------

;Targeting Uplink
[DarkEventAbility_TargetingUplink X2AbilityTemplate]
LocFriendlyName="Dark Event: Targeting Uplink"
LocFlyoverText="Dark Event: Targeting Uplink"
LocLongDescription="After hitting a target with an attack, ADVENT soldiers within <Ability:TARGETINGUPLINK_RADIUS/> tiles gain +<Ability:TARGETINGUPLINK_AIM/> aim and +<Ability:TARGETINGUPLINK_CRIT/> critical chance for <Ability:TARGETINGUPLINK_DURATION/> turn(s). This bonus stacks."
LocHelpText="Provides aim and crit bonuses to nearby allies after hitting an enemy." 
LocPromotionPopupText="After hitting a target with an attack, ADVENT soldiers within <Ability:TARGETINGUPLINK_RADIUS/> tiles gain +<Ability:TARGETINGUPLINK_AIM/> aim and +<Ability:TARGETINGUPLINK_CRIT/> critical chance for <Ability:TARGETINGUPLINK_DURATION/> turn(s). This bonus stacks."

[DarkEvent_TargetingUplink X2DarkEventTemplate]
+DisplayName="ADVENT Targeting Uplink"
+SummaryText="After an ADVENT soldier hits a target with an attack, all nearby ADVENT soldiers gain bonuses to aim and critical chance."
+QuoteText="\"...Holy crap, I think they can see through eachother's eyes! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="After an ADVENT soldier hits a target with an attack, all nearby ADVENT soldiers gain bonuses to aim and critical chance."
+PostMissionSuccessText="Dark Event Countered: Targeting Uplink"
+PostMissionFailureText="Failed to Counter Dark Event: Targeting Uplink"

;Defensive Tactics
[DarkEventAbility_DefensiveTactics X2AbilityTemplate]
LocFriendlyName="Dark Event: Defensive Tactics"
LocFlyoverText="Dark Event: Defensive Tactics"
LocLongDescription="When an ADVENT soldier dies, all other ADVENT soldiers within <Ability:DEFENSIVETACTICS_RADIUS/> tiles gain bonuses to +<Ability:DEFENSIVETACTICS_DEFENSE/> defense and +<Ability:DEFENSIVETACTICS_DODGE/> dodge for <Ability:DEFENSIVETACTICS_DURATION/> turn(s). This bonus stacks."
LocHelpText="Upon death, nearby ADVENT allies gain bonuses to defense and dodge." 
LocPromotionPopupText="When an ADVENT soldier dies, all other ADVENT soldiers within <Ability:DEFENSIVETACTICS_RADIUS/> tiles gain bonuses to +<Ability:DEFENSIVETACTICS_DEFENSE/> defense and +<Ability:DEFENSIVETACTICS_DODGE/> dodge for <Ability:DEFENSIVETACTICS_DURATION/> turn(s). This bonus stacks."

[DarkEvent_DefensiveTactics X2DarkEventTemplate]
+DisplayName="ADVENT Defensive Tactics"
+SummaryText="When an ADVENT soldier dies, all other nearby ADVENT soldiers gain bonuses to defense and dodge."
+QuoteText="\"...Looks like these guys are learning quickly from their buddy's mistakes. \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="When an ADVENT soldier dies, all other nearby ADVENT soldiers gain bonuses to defense and dodge."
+PostMissionSuccessText="Dark Event Countered: Defensive Tactics"
+PostMissionFailureText="Failed to Counter Dark Event: Defensive Tactics"

;--------------------------------
;Robot Dark Events and Abilities
;--------------------------------
[DarkEventAbility_ElectromagneticShielding X2AbilityTemplate]
LocFriendlyName="Dark Event: Electromagnetic Shielding"
LocFlyoverText="Dark Event: Electromagnetic Shielding"
LocLongDescription="While armored, all ADVENT robotic units are immune to stun and freeze effects and gain +<Ability:ELECTROMAGNETIC_SHIELDING_HACK_DEFENSE/>% increased hack defense."
LocHelpText="Immune to stun and freeze & bonus hack defense while armored." 
LocPromotionPopupText="While armored, robotic units are immune to stun and freeze effects and gain +<Ability:ELECTROMAGNETIC_SHIELDING_HACK_DEFENSE/>% increased hack defense."

[DarkEvent_ElectromagneticShielding X2DarkEventTemplate]
+DisplayName="Electromagnetic Shielding"
+SummaryText="All ADVENT robotic units receive technologically improved armor. While armored, they become immune to stun and freeze effects and gain increased hack defense."
+QuoteText="\"...It seems that ADVENT as finally figured out of their robot's greatest weaknesses. If we want to keep them in check, we first need to get rid of their armor. \""
+QuoteTextAuthor="- Chief Engineer Lily Shen"
+PreMissionText="While armored, robotic units are immune to stun and freeze effects and have increased hack defense."
+PostMissionSuccessText="Dark Event Countered: Electromagnetic Shielding"
+PostMissionFailureText="Failed to Counter Dark Event: Electromagnetic Shielding"

[DarkEventAbility_AdaptiveServos X2AbilityTemplate]
LocFriendlyName="Dark Event: Adaptive Servos"
LocFlyoverText="Dark Event: Adaptive Servos"
LocLongDescription="When unarmored, robotic units gain +<Ability:ADAPTIVE_SERVOS_MOBILITY/>% mobility, +<Ability:ADAPTIVE_SERVOS_AIM/>% aim and +<Ability:ADAPTIVE_SERVOS_DEFENSE/> defense."
LocHelpText="Increased mobility, aim and defense when unarmored." 
LocPromotionPopupText="When unarmored, robotic units gain +<Ability:ADAPTIVE_SERVOS_MOBILITY/>% mobility, +<Ability:ADAPTIVE_SERVOS_AIM/>% aim and +<Ability:ADAPTIVE_SERVOS_DEFENSE/> defense."

[DarkEvent_AdaptiveServos X2DarkEventTemplate]
+DisplayName="Adaptive Servos"
+SummaryText="All ADVENT robotic units receive improved adaptive actuators. After losing all armor, they gain bonuses to mobility, aim and defense."
+QuoteText="\"...It seems ADVENT has upgraded their robot's hardware. While destroying their armor will make it easier to take them down, the lost weight will also make them more mobile. \""
+QuoteTextAuthor="- Chief Engineer Lily Shen"
+PreMissionText="When unarmored, robotic units gain bonuses to mobility, aim and defense."
+PostMissionSuccessText="Dark Event Countered: Adaptive Servos"
+PostMissionFailureText="Failed to Counter Dark Event: Adaptive Servos"

;-------------------------------
;Viper Dark Events and Abilities
;-------------------------------
[DarkEventAbility_MaliciousInstincts X2AbilityTemplate]
LocFriendlyName="Dark Event: Malicious Instincts"
LocFlyoverText="Dark Event: Malicious Instincts"
LocLongDescription="Receives an bonus +<Ability:MALICIOUS_INSTINCTS_AIM_BONUS/> aim and deals +<Ability:MALICIOUS_INSTINCTS_DAMAGE_BONUS/>% increased damage when attacking targets suffering from Burning, Poison, Acid, or Bleeding."
LocHelpText="Bonus aim and deal increased damage against targets suffering from Burning, Poison, Acid, or Bleeding." 
LocPromotionPopupText="Receives an bonus +<Ability:MALICIOUS_INSTINCTS_AIM_BONUS/> aim and deals +<Ability:MALICIOUS_INSTINCTS_DAMAGE_BONUS/>% increased damage when attacking targets suffering from Burning, Poison, Acid, or Bleeding."

[DarkEvent_MaliciousInstincts X2DarkEventTemplate]
+DisplayName="Malicious Instincts"
+SummaryText="All Vipers receive bonuses to aim and damage on attacks against targets suffering from Burning, Poison, Acid, or Bleeding."
+QuoteText="\"...Quick, gimme that medkit! The snake is giving me the ol' stink eye. Think she's about to eat me! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="Vipers receive bonuses to aim and damage on attacks against targets suffering from Burning, Poison, Acid, or Bleeding."
+PostMissionSuccessText="Dark Event Countered: Malicious Instincts"
+PostMissionFailureText="Failed to Counter Dark Event: Malicious Instincts"

[DarkEventAbility_MutatedGlands X2AbilityTemplate]
LocFriendlyName="Dark Event: Mutated Glands"
LocFlyoverText="Dark Event: Mutated Glands"
LocLongDescription="Deals +<Ability:MUTATED_GLANDS_DAMAGE_BONUS/> damage with attacks that deal poison, acid, fire or psionic damage."
LocHelpText="Deals increased damage with attacks that deal poison, acid, fire or psionic damage." 
LocPromotionPopupText="Deals +<Ability:MUTATED_GLANDS_DAMAGE_BONUS/> damage with attacks that deal poison, acid, fire or psionic damage."

[DarkEvent_MutatedGlands X2DarkEventTemplate]
+DisplayName="Mutated Glands"
+SummaryText="All Vipers deal increased damage with attacks that deal poison, acid, fire or psionic damage."
+QuoteText="\"...It would appear that the Vipers have undergone a mutation, enhancing the potency of their endogenous poison glands. We should take precautions to ensure that our soldiers do not suffer prolonged exposure to these aggressive toxins. \""
+QuoteTextAuthor="- Chief Scientist Dr. Richard Tygan"
+PreMissionText="All Vipers deal increased damage with attacks that deal poison, acid, fire or psionic damage."
+PostMissionSuccessText="Dark Event Countered: Mutated Glands"
+PostMissionFailureText="Failed to Counter Dark Event: Mutated Glands"

;---------------------------------
;Sectoid Dark Events and Abilities
;---------------------------------

;Solace
[DarkEventAbility_Solace X2AbilityTemplate]
LocFriendlyName="Dark Event: Solace"
LocFlyoverText="Dark Event: Solace"
LocLongDescription="Shields unit and nearby allies from all harmful mental effects."
LocHelpText="Shields unit and nearby allies from all harmful mental effects." 
LocPromotionPopupText="Shields unit and nearby allies from all harmful mental effects."

[DarkEvent_Solace X2DarkEventTemplate]
+DisplayName="Solace"
+SummaryText="All Sectoids gain the Solace ability, shielding themselves and nearby allies from all harmful mental effects."
+QuoteText="\"...What's that purple mist leaking out of that sectoid's ear? And why don't they care about my flashbang?! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="Sectoids gain the Solace ability, shielding themselves and nearby allies from all harmful mental effects."
+PostMissionSuccessText="Dark Event Countered: Solace"
+PostMissionFailureText="Failed to Counter Dark Event: Solace"

;Battle Premonition
[DarkEventAbility_BattlePremonition X2AbilityTemplate]
LocFriendlyName="Dark Event: Battle Premonition"
LocFlyoverText="Dark Event: Battle Premonition"
LocLongDescription="This unit doesn't trigger overwatch. While above <Ability:BATTLE_PREMONITION_HP_THRESHOLD/>% health and unimpaired, this unit gains +<Ability:BATTLE_PREMONITION_DODGE/> dodge and +<Ability:BATTLE_PREMONITION_DEFENSE/> defense."
LocHelpText="While above <Ability:BATTLE_PREMONITION_HP_THRESHOLD/>% health and unimpaired, this unit gains +<Ability:BATTLE_PREMONITION_DODGE/> dodge and +<Ability:BATTLE_PREMONITION_DEFENSE/> defense." 
LocPromotionPopupText="This unit doesn't trigger overwatch. While above <Ability:BATTLE_PREMONITION_HP_THRESHOLD/>% health and unimpaired, this unit gains +<Ability:BATTLE_PREMONITION_DODGE/> dodge and +<Ability:BATTLE_PREMONITION_DEFENSE/> defense."

[DarkEvent_BattlePremonition X2DarkEventTemplate]
+DisplayName="Battle Premonition"
+SummaryText="All Sectoids gain the Battle Premonition ability. Units with the Battle Premonition do not trigger reaction fire and while healthy and unimpaired, they receive massive bonuses to dodge and defense."
+QuoteText="\"...It would appear the Sectoid's psionic powers allow them to anticipate our soldier's intentions. \""
+QuoteTextAuthor="- Chief Scientist Dr. Richard Tygan"
+PreMissionText="All Sectoids gain the Battle Premonition ability. Units with the Battle Premonition do not trigger reaction fire and while healthy and unimpaired, they receive massive bonuses to dodge and defense."
+PostMissionSuccessText="Dark Event Countered: Battle Premonition"
+PostMissionFailureText="Failed to Counter Dark Event: Battle Premonition"

;-----------------------------------
;Berserker Dark Events and Abilities
;-----------------------------------

;Intimidate
[DarkEventAbility_Intimidate X2AbilityTemplate]
LocFriendlyName="Dark Event: Intimidating Presence"
LocFlyoverText="Dark Event: Intimidating Presence"
LocLongDescription="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 
LocHelpText="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 
LocPromotionPopupText="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 

[IndimidateAura X2AbilityTemplate]
LocFriendlyName="Dark Event: Intimidating Presence"
LocFlyoverText="Dark Event: Intimidating Presence"
LocLongDescription="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 
LocHelpText="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 
LocPromotionPopupText="All hostile organic units within <Ability:INTIMIDATE_ABILITY_MAX_TILES/> tiles of the Berserker suffer penalties of -<Ability:INTIMIDATE_ABILITY_AIM_PENALTY/>% aim, -<Ability:INTIMIDATE_ABILITY_MOBILITY_PENALTY/>% mobility and -<Ability:INTIMIDATE_ABILITY_WILL_PENALTY/>% will. Multiple Berserkers will increase the strength of the effect. Does not affect robotic units or units that are immune to mental effects." 

[DarkEvent_Intimidate X2DarkEventTemplate]
+DisplayName="Intimidating Presence"
+SummaryText="All Berserkers gain the Intimidating Presence ability, lowering the aim, mobility and will of all organic enemies in their vicinity."
+QuoteText="\"...Oh my god, that thing ripped Sergeant Gruffle's head off! Let the robot deal with this shit, I'm out! \""
+QuoteTextAuthor="- Corporal Beachy"
+PreMissionText="All Berserkers gain the Intimidating Presence ability, lowering the aim, mobility and will of all organic enemies in their vicinity."
+PostMissionSuccessText="Dark Event Countered: Intimidating Presence"
+PostMissionFailureText="Failed to Counter Dark Event: Intimidating Presence"

;Unstoppable Force
[DarkEventAbility_UnstoppableForce X2AbilityTemplate]
LocFriendlyName="Dark Event: Unstoppable Force"
LocLongDescription="Immune to poison, stun, Chryssalid poison and mental status effects."
LocHelpText="Immune to poison, stun, Chryssalid poison and mental status effects."

[DarkEvent_UnstoppableForce X2DarkEventTemplate]
+DisplayName="Unstoppable Force"
+SummaryText="All Berserkers gain the Unstoppable Force ability, making them immune to poison, stun, Chryssalid poison and mental status effects."
+QuoteText="\"...It's like it doesn't feel anything... and it's just getting angrier! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="Berserkers gain the Unstoppable Force ability, making them immune to poison, stun, Chryssalid poison and mental status effects."
+PostMissionSuccessText="Dark Event Countered: Unstoppable Force"
+PostMissionFailureText="Failed to Counter Dark Event: Unstoppable Force"

;-------------------------------
;Muton Dark Events and Abilities 
;-------------------------------

;Combat Hardened
[DarkEventAbility_CombatHardened X2AbilityTemplate]
LocFriendlyName="Dark Event: Combat Hardened"
LocLongDescription="Takes <Ability:COMBAT_HARDENED_EXPLOSIVE_REDUCTION/>% less damage from explosive attacks and enemy attacks suffer -<Ability:COMBAT_HARDENED_CRITDEF_BONUS/>% chance to critically hit."
LocHelpText="Takes <Ability:COMBAT_HARDENED_EXPLOSIVE_REDUCTION/>% less damage from explosive attacks and enemy attacks suffer -<Ability:COMBAT_HARDENED_CRITDEF_BONUS/>% chance to critically hit."

[DarkEvent_CombatHardened X2DarkEventTemplate]
+DisplayName="Combat Hardened"
+SummaryText="All Mutons gain the Combat Hardened ability, making them highly resistant to explosive damage and critical hits."
+QuoteText="\"...Seems like these things really know how to fight. We have to think quickly if we want to make it out of this one! \""
+QuoteTextAuthor="- Central Officer Bradford"
+PreMissionText="Mutons gain the Combat Hardened ability, making them highly resistant to explosive damage and critical hits."
+PostMissionSuccessText="Dark Event Countered: Combat Hardened"
+PostMissionFailureText="Failed to Counter Dark Event: Combat Hardened"

;Close Combat Specialist
[DarkEventAbility_CloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Dark Event: Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During XCOM turns, fires a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During XCOM turns, fires a free reaction shot at any visible enemy within four tiles who moves or fires."

[DarkEvent_CloseCombatSpecialist X2DarkEventTemplate]
+DisplayName="Close Combat Specialist"
+SummaryText="All Mutons gain the Close Combat Specialist ability, granting them a free reaction shot with their primary weapon at any visible enemy within four tiles who moves or fires."
+QuoteText="\"...Make sure to keep your distance. Those mountains of muscle are surprisingly quick in close quarters combat! \""
+QuoteTextAuthor="- Central Officer Bradford"
+PreMissionText="Mutons gain the Close Combat Specialist ability, granting them a free reaction shot with their primary weapon at any visible enemy within four tiles who moves or fires."
+PostMissionSuccessText="Dark Event Countered: Close Combat Specialist"
+PostMissionFailureText="Failed to Counter Dark Event: Close Combat Specialist"


;------------------------------------
;Chryssalid Dark Events and Abilities
;------------------------------------

; Eviscerate
[DarkEventAbility_Eviscerate X2AbilityTemplate]
LocFriendlyName="Dark Event: Eviscerate"
LocFlyoverText="Dark Event: Eviscerate"
LocLongDescription="Receives +<Ability:EVISCERATE_AIM_BONUS/> and +<Ability:EVISCERATE_CRIT_BONUS/> crit chance when attacking wounded targets. Melee attacks against organic targets heal the Chryssalid for <Ability:EVISCERATE_MULTIPLIER/>% of damage dealt."
LocHelpText="Receives +<Ability:EVISCERATE_AIM_BONUS/> and +<Ability:EVISCERATE_CRIT_BONUS/> crit chance when attacking wounded targets. Melee attacks against organic targets heal the Chryssalid for <Ability:EVISCERATE_MULTIPLIER/>% of damage dealt." 
LocPromotionPopupText="Receives +<Ability:EVISCERATE_AIM_BONUS/> and +<Ability:EVISCERATE_CRIT_BONUS/> crit chance when attacking wounded targets. Melee attacks against organic targets heal the Chryssalid for <Ability:EVISCERATE_MULTIPLIER/>% of damage dealt."

[DarkEvent_Eviscerate X2DarkEventTemplate]
+DisplayName="Eviscerate"
+SummaryText="All Chryssalids receive large bonuses to aim and crit chance when attacking wounded targets. Melee attacks against organic targets heal the Chryssalid for 100% of damage dealt."
+QuoteText="\"...These things are going straight for the kill. We need to shield our wounded! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Chryssalids receive large bonuses to aim and crit chance when attacking wounded targets. Melee attacks against organic targets heal the Chryssalid for 100% of damage dealt."
+PostMissionSuccessText="Dark Event Countered: Eviscerate"
+PostMissionFailureText="Failed to Counter Dark Event: Eviscerate"

; Nimble Claws
[DarkEventAbility_NimbleClaws X2AbilityTemplate]
LocFriendlyName="Dark Event: Nimble Claws"
LocFlyoverText="Dark Event: Nimble Claws"
LocLongDescription="After hitting an enemy with a melee attack, gains +<Ability:NIMBLE_CLAWS_MOBILITY/>% mobility for <Ability:NIMBLE_CLAWS_MOBILITY_DURATION/> turns. After taking damage, gains +<Ability:NIMBLE_CLAWS_DODGE/> dodge for <Ability:NIMBLE_CLAWS_DODGE_DURATION/> turns. These effects can stack."
LocHelpText="Bonus mobility after dealing melee damage. Bonus dodge after taking damage." 
LocPromotionPopupText="After hitting an enemy with a melee attack, gains +<Ability:NIMBLE_CLAWS_MOBILITY/>% mobility for <Ability:NIMBLE_CLAWS_MOBILITY_DURATION/> turns. After taking damage, gains +<Ability:NIMBLE_CLAWS_DODGE/> dodge for <Ability:NIMBLE_CLAWS_DODGE_DURATION/> turns. These effects can stack."

[NimbleClaws_DodgeBuffTrigger X2AbilityTemplate]
LocFriendlyName="Dark Event: Nimble Claws"
LocFlyoverText="Nimble Claws: Bonus dodge"
LocLongDescription="Gains ++<Ability:NIMBLE_CLAWS_DODGE/> dodge after taking damage."
LocHelpText="Gains +<Ability:NIMBLE_CLAWS_DODGE/> dodge after taking damage." 
LocPromotionPopupText="Gains +<Ability:NIMBLE_CLAWS_DODGE/> dodge after taking damage."

[NimbleClaws_MobilityBuffTrigger X2AbilityTemplate]
LocFriendlyName="Dark Event: Nimble Claws"
LocFlyoverText="Nimble Claws: Bonus mobility"
LocLongDescription="Gains +<Ability:NIMBLE_CLAWS_MOBILITY/>% mobility after hitting with a melee attack."
LocHelpText="Gains +<Ability:NIMBLE_CLAWS_MOBILITY/>% mobility after hitting with a melee attack." 
LocPromotionPopupText="Gains +<Ability:NIMBLE_CLAWS_MOBILITY/>% mobility after hitting with a melee attack."

[DarkEvent_NimbleClaws X2DarkEventTemplate]
+DisplayName="Nimble Claws"
+SummaryText="Improved strength and speed allows all Chryssalids to move and dodge more swiftly in combat. After hitting an enemy with a melee attack, Chryssalids gain bonus mobility. After taking damage, they gain bonus dodge."
+QuoteText="\"...Better get out the big guns to make sure those things don't get a chance to get in close! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="After hitting an enemy with a melee attack, Chryssalids gain bonus mobility. After taking damage, they gain bonus dodge."
+PostMissionSuccessText="Dark Event Countered: Nimble Claws"
+PostMissionFailureText="Failed to Counter Dark Event: Nimble Claws"
